//=============================================================================
//
// boss.h
// Author : Ricci Alex
//
//=============================================================================

#ifndef _BOSS_H_
#define _BOSS_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "model.h"

//=============================================================================
//前方宣言
//=============================================================================



class CBoss : public CModel
{
public:
	CBoss();						//コンストラクタ
	~CBoss() override;				//デストラクタ
									
	HRESULT Init(void) override;	//初期化処理
	void Uninit(void) override;		//終了処理
	void Update(void) override;		//更新処理
	

	static CBoss* Create(void);		//生成処理

private:

	static const D3DXVECTOR3 DEFAULT_POS;			//ディフォルトの位置


	D3DXVECTOR3 m_targetPos;	//攻撃の位置
	int m_nCntAttack;			//攻撃カウンター

};


#endif