//=============================================================================
//
// bossStage.h
// Author : Ricci Alex
//
//=============================================================================
#ifndef _BOSS_STAGE_H
#define _BOSS_STAGE_H

//=============================================================================
//インクルードファイル
//=============================================================================
#include "game.h"

//=============================================================================
//前方宣言
//=============================================================================


class CBossStage : public CGame
{
public:

	CBossStage();						//コンストラクタ
	~CBossStage() override;				//デストラクタ
										
	HRESULT Init(void) override;		//初期化処理
	void Uninit(void) override;			//終了処理
	void Update(void) override;			//更新処理

	static CBossStage* Create(void);	//生成処理

private:

};


#endif