//=============================================================================
//
// secondStage.h
// Author : Ricci Alex
//
//=============================================================================
#ifndef _SECOND_STAGE_H
#define _SECOND_STAGE_H

//=============================================================================
//インクルードファイル
//=============================================================================
#include "game.h"

//=============================================================================
//前方宣言
//=============================================================================

class CSecondStage : public CGame
{
public:
	CSecondStage();								//コンストラクタ
	~CSecondStage() override;					//デストラクタ

	HRESULT Init(void);							//初期化処理
	void Uninit(void);							//終了処理
	void Update(void);							//更新処理

	static CSecondStage* Create(void);			//生成処理

private:

};


#endif